<table align="left">
  <td>
    <a href="https://colab.research.google.com/github/marco-canas/introducci-n-al-Machine-Learning/blob/main/examples_bank/taller_3_pandas/4_ejer_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>
  </td>
  <td>
    <a target="_blank" href="https://kaggle.com/kernels/welcome?src=https://github.com/marco-canas/introducci-n-al-Machine-Learning/blob/main/examples_bank/taller_3_pandas/4_ejer_pandas.ipynb"><img src="https://kaggle.com/static/images/open-in-kaggle.svg" /></a>
  </td>
</table>

# Ejercicio 4 Pandas

Escribir programa que genere y muestre por pantalla un `DataFrame` con los datos de la tabla siguiente:

| Mes     | Ventas | Gastos |
| ------- | -----: | -----: |
| Enero   |  30500 |  22000 |
| Febrero |  35600 |  23400 |
| Marzo   |  28300 |  18100 |
| Abril   |  33900 |  20700 |

In [1]:
import pandas as pd

datos = {'Mes':['Enero', 'Febrero', 'Marzo', 'Abril'],\
         'Ventas':[30500, 35600, 28300, 33900], \
         'Gastos':[22000, 23400, 18100, 20700]}
contabilidad = pd.DataFrame(datos)
contabilidad

       Mes  Ventas  Gastos
0    Enero   30500   22000
1  Febrero   35600   23400
2    Marzo   28300   18100
3    Abril   33900   20700

## Una segunda manera

In [2]:
ventas_gastos = {'ventas':[30500, 35600, 28300, 33900], 'gastos':[22000, 23400, 18100, 20700]}
index = pd.Series(['enero', 'febrero', 'marzo', 'abril'], name = 'mes')

contabilidad2 = pd.DataFrame(ventas_gastos, index = index)

contabilidad2

         ventas  gastos
mes
enero     30500   22000
febrero   35600   23400
marzo     28300   18100
abril     33900   20700

## Práctica de escritura del código

1. Crear un diccionario
2. Utilizamos `pd.DataFrame`
3. imprimimos

In [1]:
ventas_gastos_d = {'meses':['enero', 'febrero', 'marzo', 'abril'],\
                  'ventas':[30500, 35600, 28300, 33900], \
                   'gastos':[22000,23400, 18100, 20700]
                  }

In [3]:
ventas_gastos_d

{'meses': ['enero', 'febrero', 'marzo', 'abril'],
 'ventas': [30500, 35600, 28300, 33900],
 'gastos': [22000, 23400, 18100, 20700]}

In [4]:
import pandas as pd 
ventas_gastos_df = pd.DataFrame(ventas_gastos_d)
ventas_gastos_df

     meses  ventas  gastos
0    enero   30500   22000
1  febrero   35600   23400
2    marzo   28300   18100
3    abril   33900   20700

In [5]:
ventas_gastos_df.index = ventas_gastos_df.meses

In [6]:
ventas_gastos_df

           meses  ventas  gastos
meses
enero      enero   30500   22000
febrero  febrero   35600   23400
marzo      marzo   28300   18100
abril      abril   33900   20700

In [9]:
del ventas_gastos_df['meses']

In [10]:
ventas_gastos_df

         ventas  gastos
meses
enero     30500   22000
febrero   35600   23400
marzo     28300   18100
abril     33900   20700